IOTracer_tests/fio_tests/fio_results_kernel_submit
fio_job1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.35
Starting 1 thread

fio_job1: (groupid=0, jobs=1): err= 0: pid=38113: Thu May 30 15:03:37 2024
  read: IOPS=24.3k, BW=94.8MiB/s (99.4MB/s)(1024MiB/10807msec)
    clat (usec): min=22, max=4159, avg=40.44, stdev=49.78
     lat (usec): min=22, max=4160, avg=40.51, stdev=49.80
    clat percentiles (usec):
     |  1.00th=[   25],  5.00th=[   26], 10.00th=[   26], 20.00th=[   27],
     | 30.00th=[   28], 40.00th=[   29], 50.00th=[   30], 60.00th=[   33],
     | 70.00th=[   36], 80.00th=[   39], 90.00th=[   55], 95.00th=[   95],
     | 99.00th=[  159], 99.50th=[  404], 99.90th=[  594], 99.95th=[  693],
     | 99.99th=[ 1631]
   bw (  KiB/s): min=84392, max=119680, per=100.00%, avg=97681.52, stdev=10078.34, samples=21
   iops        : min=21098, max=29920, avg=24420.38, stdev=2519.59, samples=21
  lat (usec)   : 50=88.98%, 100=6.98%, 250=3.42%, 500=0.36%, 750=0.23%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.02%, 4=0.01%, 10=0.01%
  cpu          : usr=3.54%, sys=34.31%, ctx=262449, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=94.8MiB/s (99.4MB/s), 94.8MiB/s-94.8MiB/s (99.4MB/s-99.4MB/s), io=1024MiB (1074MB), run=10807-10807msec
n------------------------------------------n
fio_job1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.35
Starting 1 thread

fio_job1: (groupid=0, jobs=1): err= 0: pid=38131: Thu May 30 15:03:49 2024
  read: IOPS=22.2k, BW=86.7MiB/s (90.9MB/s)(1024MiB/11809msec)
    clat (usec): min=22, max=5805, avg=44.26, stdev=56.42
     lat (usec): min=23, max=5806, avg=44.34, stdev=56.43
    clat percentiles (usec):
     |  1.00th=[   25],  5.00th=[   26], 10.00th=[   27], 20.00th=[   27],
     | 30.00th=[   28], 40.00th=[   29], 50.00th=[   30], 60.00th=[   32],
     | 70.00th=[   36], 80.00th=[   40], 90.00th=[   87], 95.00th=[  109],
     | 99.00th=[  217], 99.50th=[  461], 99.90th=[  635], 99.95th=[  717],
     | 99.99th=[ 1319]
   bw (  KiB/s): min=44688, max=123376, per=100.00%, avg=89916.87, stdev=23719.83, samples=23
   iops        : min=11172, max=30844, avg=22479.22, stdev=5929.96, samples=23
  lat (usec)   : 50=85.49%, 100=8.13%, 250=5.44%, 500=0.56%, 750=0.35%
  lat (usec)   : 1000=0.02%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=3.04%, sys=31.22%, ctx=262439, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=86.7MiB/s (90.9MB/s), 86.7MiB/s-86.7MiB/s (90.9MB/s-90.9MB/s), io=1024MiB (1074MB), run=11809-11809msec
n------------------------------------------n
fio_job1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.35
Starting 1 thread

fio_job1: (groupid=0, jobs=1): err= 0: pid=38149: Thu May 30 15:04:02 2024
  read: IOPS=21.3k, BW=83.3MiB/s (87.3MB/s)(1024MiB/12299msec)
    clat (usec): min=22, max=3858, avg=46.13, stdev=61.37
     lat (usec): min=22, max=3858, avg=46.23, stdev=61.39
    clat percentiles (usec):
     |  1.00th=[   26],  5.00th=[   26], 10.00th=[   27], 20.00th=[   27],
     | 30.00th=[   28], 40.00th=[   29], 50.00th=[   30], 60.00th=[   32],
     | 70.00th=[   36], 80.00th=[   40], 90.00th=[   90], 95.00th=[  118],
     | 99.00th=[  388], 99.50th=[  523], 99.90th=[  652], 99.95th=[  709],
     | 99.99th=[ 1483]
   bw (  KiB/s): min=38968, max=114840, per=100.00%, avg=85502.67, stdev=23333.38, samples=24
   iops        : min= 9742, max=28710, avg=21375.67, stdev=5833.34, samples=24
  lat (usec)   : 50=84.51%, 100=8.03%, 250=6.33%, 500=0.57%, 750=0.52%
  lat (usec)   : 1000=0.02%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=2.84%, sys=29.53%, ctx=262601, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=83.3MiB/s (87.3MB/s), 83.3MiB/s-83.3MiB/s (87.3MB/s-87.3MB/s), io=1024MiB (1074MB), run=12299-12299msec
n------------------------------------------n
fio_job1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.35
Starting 1 thread

fio_job1: (groupid=0, jobs=1): err= 0: pid=38175: Thu May 30 15:04:18 2024
  read: IOPS=16.9k, BW=65.8MiB/s (69.0MB/s)(1024MiB/15554msec)
    clat (usec): min=22, max=4075, avg=58.50, stdev=75.77
     lat (usec): min=22, max=4075, avg=58.58, stdev=75.80
    clat percentiles (usec):
     |  1.00th=[   25],  5.00th=[   26], 10.00th=[   27], 20.00th=[   28],
     | 30.00th=[   28], 40.00th=[   30], 50.00th=[   32], 60.00th=[   36],
     | 70.00th=[   42], 80.00th=[   88], 90.00th=[  115], 95.00th=[  141],
     | 99.00th=[  469], 99.50th=[  553], 99.90th=[  693], 99.95th=[  758],
     | 99.99th=[ 1483]
   bw (  KiB/s): min=42520, max=124408, per=100.00%, avg=67501.68, stdev=30051.91, samples=31
   iops        : min=10630, max=31102, avg=16875.42, stdev=7512.98, samples=31
  lat (usec)   : 50=73.26%, 100=12.70%, 250=11.97%, 500=1.24%, 750=0.77%
  lat (usec)   : 1000=0.04%
  lat (msec)   : 2=0.02%, 4=0.01%, 10=0.01%
  cpu          : usr=2.31%, sys=24.22%, ctx=262641, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=65.8MiB/s (69.0MB/s), 65.8MiB/s-65.8MiB/s (69.0MB/s-69.0MB/s), io=1024MiB (1074MB), run=15554-15554msec
n------------------------------------------n
fio_job1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.35
Starting 1 thread

fio_job1: (groupid=0, jobs=1): err= 0: pid=38200: Thu May 30 15:04:29 2024
  read: IOPS=25.5k, BW=99.6MiB/s (104MB/s)(1024MiB/10283msec)
    clat (usec): min=22, max=3098, avg=38.57, stdev=45.09
     lat (usec): min=22, max=3098, avg=38.65, stdev=45.10
    clat percentiles (usec):
     |  1.00th=[   25],  5.00th=[   26], 10.00th=[   26], 20.00th=[   27],
     | 30.00th=[   27], 40.00th=[   28], 50.00th=[   28], 60.00th=[   30],
     | 70.00th=[   32], 80.00th=[   37], 90.00th=[   47], 95.00th=[   93],
     | 99.00th=[  169], 99.50th=[  404], 99.90th=[  586], 99.95th=[  660],
     | 99.99th=[  906]
   bw (  KiB/s): min=90568, max=121976, per=100.00%, avg=102720.80, stdev=11169.10, samples=20
   iops        : min=22642, max=30494, avg=25680.20, stdev=2792.28, samples=20
  lat (usec)   : 50=90.59%, 100=5.50%, 250=3.30%, 500=0.35%, 750=0.24%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=2.93%, sys=32.89%, ctx=262398, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=99.6MiB/s (104MB/s), 99.6MiB/s-99.6MiB/s (104MB/s-104MB/s), io=1024MiB (1074MB), run=10283-10283msec
n------------------------------------------n