IOTracer_tests/fio_tests/fio_results_ringbuf_128kb
fio_job1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.35
Starting 1 thread

fio_job1: (groupid=0, jobs=1): err= 0: pid=65348: Fri May 24 05:32:19 2024
  read: IOPS=10.7k, BW=41.6MiB/s (43.6MB/s)(1024MiB/24608msec)
    clat (usec): min=27, max=7606, avg=92.97, stdev=80.60
     lat (usec): min=27, max=7607, avg=93.07, stdev=80.61
    clat percentiles (usec):
     |  1.00th=[   31],  5.00th=[   32], 10.00th=[   32], 20.00th=[   35],
     | 30.00th=[   44], 40.00th=[   90], 50.00th=[   93], 60.00th=[  101],
     | 70.00th=[  106], 80.00th=[  122], 90.00th=[  143], 95.00th=[  159],
     | 99.00th=[  482], 99.50th=[  644], 99.90th=[  881], 99.95th=[  979],
     | 99.99th=[ 2073]
   bw (  KiB/s): min=30728, max=86872, per=100.00%, avg=42652.08, stdev=12505.07, samples=49
   iops        : min= 7682, max=21718, avg=10663.02, stdev=3126.27, samples=49
  lat (usec)   : 50=32.53%, 100=26.44%, 250=39.75%, 500=0.31%, 750=0.72%
  lat (usec)   : 1000=0.20%
  lat (msec)   : 2=0.04%, 4=0.01%, 10=0.01%
  cpu          : usr=1.60%, sys=22.12%, ctx=262357, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=41.6MiB/s (43.6MB/s), 41.6MiB/s-41.6MiB/s (43.6MB/s-43.6MB/s), io=1024MiB (1074MB), run=24608-24608msec
n------------------------------------------n
fio_job1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.35
Starting 1 thread

fio_job1: (groupid=0, jobs=1): err= 0: pid=65414: Fri May 24 05:32:45 2024
  read: IOPS=10.3k, BW=40.4MiB/s (42.4MB/s)(1024MiB/25337msec)
    clat (usec): min=27, max=7597, avg=95.65, stdev=82.93
     lat (usec): min=27, max=7597, avg=95.77, stdev=82.96
    clat percentiles (usec):
     |  1.00th=[   32],  5.00th=[   33], 10.00th=[   34], 20.00th=[   37],
     | 30.00th=[   47], 40.00th=[   91], 50.00th=[   94], 60.00th=[  103],
     | 70.00th=[  110], 80.00th=[  126], 90.00th=[  145], 95.00th=[  163],
     | 99.00th=[  502], 99.50th=[  652], 99.90th=[  898], 99.95th=[ 1012],
     | 99.99th=[ 2311]
   bw (  KiB/s): min=30032, max=88424, per=100.00%, avg=41497.12, stdev=12420.29, samples=50
   iops        : min= 7508, max=22106, avg=10374.28, stdev=3105.07, samples=50
  lat (usec)   : 50=31.68%, 100=24.76%, 250=42.20%, 500=0.35%, 750=0.74%
  lat (usec)   : 1000=0.21%
  lat (msec)   : 2=0.04%, 4=0.01%, 10=0.01%
  cpu          : usr=1.72%, sys=23.23%, ctx=262521, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=40.4MiB/s (42.4MB/s), 40.4MiB/s-40.4MiB/s (42.4MB/s-42.4MB/s), io=1024MiB (1074MB), run=25337-25337msec
n------------------------------------------n
fio_job1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.35
Starting 1 thread

fio_job1: (groupid=0, jobs=1): err= 0: pid=65543: Fri May 24 05:33:10 2024
  read: IOPS=10.5k, BW=41.1MiB/s (43.1MB/s)(1024MiB/24895msec)
    clat (usec): min=26, max=5279, avg=94.04, stdev=81.17
     lat (usec): min=26, max=5279, avg=94.15, stdev=81.19
    clat percentiles (usec):
     |  1.00th=[   31],  5.00th=[   32], 10.00th=[   33], 20.00th=[   35],
     | 30.00th=[   45], 40.00th=[   90], 50.00th=[   93], 60.00th=[  102],
     | 70.00th=[  108], 80.00th=[  123], 90.00th=[  143], 95.00th=[  161],
     | 99.00th=[  490], 99.50th=[  652], 99.90th=[  898], 99.95th=[ 1004],
     | 99.99th=[ 1614]
   bw (  KiB/s): min=30576, max=99064, per=100.00%, avg=42250.78, stdev=12460.41, samples=49
   iops        : min= 7644, max=24766, avg=10562.69, stdev=3115.10, samples=49
  lat (usec)   : 50=32.21%, 100=25.30%, 250=41.18%, 500=0.33%, 750=0.72%
  lat (usec)   : 1000=0.20%
  lat (msec)   : 2=0.04%, 4=0.01%, 10=0.01%
  cpu          : usr=1.55%, sys=22.64%, ctx=262404, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=41.1MiB/s (43.1MB/s), 41.1MiB/s-41.1MiB/s (43.1MB/s-43.1MB/s), io=1024MiB (1074MB), run=24895-24895msec
n------------------------------------------n
fio_job1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.35
Starting 1 thread

fio_job1: (groupid=0, jobs=1): err= 0: pid=65607: Fri May 24 05:33:36 2024
  read: IOPS=10.4k, BW=40.5MiB/s (42.5MB/s)(1024MiB/25290msec)
    clat (usec): min=27, max=6641, avg=95.46, stdev=81.14
     lat (usec): min=27, max=6641, avg=95.57, stdev=81.16
    clat percentiles (usec):
     |  1.00th=[   32],  5.00th=[   33], 10.00th=[   33], 20.00th=[   36],
     | 30.00th=[   46], 40.00th=[   91], 50.00th=[   95], 60.00th=[  103],
     | 70.00th=[  110], 80.00th=[  125], 90.00th=[  145], 95.00th=[  161],
     | 99.00th=[  498], 99.50th=[  652], 99.90th=[  898], 99.95th=[ 1029],
     | 99.99th=[ 1631]
   bw (  KiB/s): min=29880, max=81448, per=100.00%, avg=41598.24, stdev=11578.47, samples=50
   iops        : min= 7470, max=20362, avg=10399.56, stdev=2894.62, samples=50
  lat (usec)   : 50=31.73%, 100=23.85%, 250=43.05%, 500=0.37%, 750=0.73%
  lat (usec)   : 1000=0.21%
  lat (msec)   : 2=0.05%, 4=0.01%, 10=0.01%
  cpu          : usr=1.82%, sys=23.27%, ctx=262533, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=40.5MiB/s (42.5MB/s), 40.5MiB/s-40.5MiB/s (42.5MB/s-42.5MB/s), io=1024MiB (1074MB), run=25290-25290msec
n------------------------------------------n